shuai132/BalanceCar/STM32/system/drivers/bluenrg/src/hci_dma_lp.c
/**
  ******************************************************************************
  * @file    hci_dma_lp.c 
  * @author  AMS/HESA Application Team
  * @brief   Function for managing HCI interface.
  ******************************************************************************
  *
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2013 STMicroelectronics</center></h2>
  */ 

#include "hal_types.h"
#include "osal.h"
#include "ble_status.h"
#include "hal.h"
#include "hci_const.h"
#include "gp_timer.h"

#include "bluenrg_interface.h"
#include "stm32xx_timerserver.h"

extern SPI_HandleTypeDef SpiHandle;

#if BLE_CONFIG_DBG_ENABLE
#define PRINTF(...) printf(__VA_ARGS__)
#else
#define PRINTF(...)
#endif

#define HCI_LOG_ON 0

#define HCI_READ_PACKET_NUM_MAX 		 (5)

#define MIN(a,b)            ((a) < (b) )? (a) : (b)
#define MAX(a,b)            ((a) > (b) )? (a) : (b)

static void enqueue_packet(tHciDataPacket * hciReadPacket);
static void hci_timeout_callback(void);

tListNode hciReadPktPool;
tListNode hciReadPktRxQueue;
/* pool of hci read packets */
static tHciDataPacket     hciReadPacketBuffer[HCI_READ_PACKET_NUM_MAX];

static volatile uint8_t readPacketListFull=FALSE;

static uint8_t *hci_buffer = NULL;
static volatile uint16_t hci_pckt_len;
static volatile uint8_t hci_timer_id;
static volatile uint8_t hci_timeout;

uint8_t header[HCI_HDR_SIZE + HCI_COMMAND_HDR_SIZE];

void hci_timeout_callback(void)
{
	hci_timeout = 1;

	return;
}

void HCI_Init(void)
{
    uint8_t index;
    
    /* Initialize list heads of ready and free hci data packet queues */
    list_init_head (&hciReadPktPool);
    list_init_head (&hciReadPktRxQueue);
    
    /* Initialize the queue of free hci data packets */
    for (index = 0; index < HCI_READ_PACKET_NUM_MAX; index++)
    {
        list_insert_tail(&hciReadPktPool, (tListNode *)&hciReadPacketBuffer[index]);
    }
}

#define HCI_PCK_TYPE_OFFSET                 0
#define  EVENT_PARAMETER_TOT_LEN_OFFSET     2

void Hal_Init_Event_Request(void)
{  
  tHciDataPacket * hciReadPacket = NULL;
  
  list_remove_head (&hciReadPktPool, (tListNode **)&hciReadPacket);
  
  Hal_Event_Request ((uint8_t*)hciReadPacket, HCI_READ_PACKET_SIZE);
}

static volatile hci_packet_complete_callback packet_complete_callback = NULL;

static void hci_set_packet_complete_callback(hci_packet_complete_callback cb)
{
	packet_complete_callback = cb;
}

void HCI_Input(tHciDataPacket * hciReadPacket)
{
    uint8_t byte;
    hci_acl_hdr *acl_hdr;

	static hci_state state = WAITING_TYPE;

        uint16_t collected_payload_len = 0;
	uint16_t payload_len;
    
    hci_buffer = hciReadPacket->dataBuff;
    
    if(state == WAITING_TYPE)
        hci_pckt_len = 0;
    
    while(hci_pckt_len < HCI_READ_PACKET_SIZE){

        byte = hci_buffer[hci_pckt_len++];

        if(state == WAITING_TYPE){
            /* Only ACL Data and Events packets are accepted. */
            if(byte == HCI_EVENT_PKT){
                 state = WAITING_EVENT_CODE;
            }
//            else if(byte == HCI_ACLDATA_PKT){
//                state = WAITING_HANDLE;
//            }
            else{
                /* Incorrect type. Reset state machine. */
                state = WAITING_TYPE;
                break;
            }
        }
        else if(state == WAITING_EVENT_CODE)
            state = WAITING_PARAM_LEN;
        else if(state == WAITING_HANDLE)
            state = WAITING_HANDLE_FLAG;
        else if(state == WAITING_HANDLE_FLAG)
            state = WAITING_DATA_LEN1;
        else if(state == WAITING_DATA_LEN1)
            state = WAITING_DATA_LEN2;

        else if(state == WAITING_DATA_LEN2){
            acl_hdr = (void *)&hci_buffer[HCI_HDR_SIZE];
            payload_len = acl_hdr->dlen;
            collected_payload_len = 0;
            state = WAITING_PAYLOAD;
        }
        else if(state == WAITING_PARAM_LEN){
             payload_len = byte;
             collected_payload_len = 0;
             state = WAITING_PAYLOAD;
        }
        else if(state == WAITING_PAYLOAD){
            collected_payload_len += 1;
            if(collected_payload_len >= payload_len){
                /* Reset state machine. */
                state = WAITING_TYPE;
                enqueue_packet(hciReadPacket);
                
                if(packet_complete_callback){
                  uint16_t len = hci_pckt_len;
                  packet_complete_callback(hci_buffer, len);
                }
                break;
            }
        }
    }        
}

void enqueue_packet(tHciDataPacket * hciReadPacket)
{
    hci_uart_pckt *hci_pckt = (void*)hciReadPacket->dataBuff;
    hci_event_pckt *event_pckt = (void*)hci_pckt->data;
    
    // Do not enqueue Command Complete or Command Status events
    
    if((hci_pckt->type != HCI_EVENT_PKT) ||
       event_pckt->evt == EVT_CMD_COMPLETE ||
           event_pckt->evt == EVT_CMD_STATUS){
        // Insert the packet back into the pool.
        list_insert_tail(&hciReadPktPool, (tListNode *)hciReadPacket);
    }
    else {    
        // Insert the packet into the queue of events to be processed.
        list_insert_tail(&hciReadPktRxQueue, (tListNode *)hciReadPacket);
        HCI_Process_Notification_Request();
    }
}

void HCI_Process(void)
{
    //uint8_t data_len;
    //uint8_t buffer[HCI_PACKET_SIZE];
    tHciDataPacket * hciReadPacket = NULL;

    uint8_t list_empty = list_is_empty(&hciReadPktRxQueue);        
    /* process any pending events read */
    while(list_empty == FALSE)
    {
        list_remove_head (&hciReadPktRxQueue, (tListNode **)&hciReadPacket);
        HCI_Event_CB(hciReadPacket->dataBuff);
        list_insert_tail(&hciReadPktPool, (tListNode *)hciReadPacket);
        list_empty = list_is_empty(&hciReadPktRxQueue);
    }
}

BOOL HCI_Queue_Empty(void)
{
  return list_is_empty(&hciReadPktRxQueue);
}

